Documents/ПеремещениеЖивотного.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПеремещениеЖивотного</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыМестаСодержанияЖивотных</xr:Item>
				<xr:Item>AccumulationRegister.ЗаполненностьКомнат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомнатаДо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комнаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомнатаПосле</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комнаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПеремещенияЖивотных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтатусыМестаСодержанияЖивотных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыМестаСодержанияЖивотных</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПребыванияЖивотных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоСодержания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Комнаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПеремещенияЖивотных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПребыванияЖивотных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПребыванияЖивотных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаКарантине</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЛеченииПриют</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЛеченииВетклиника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКУкотовлению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Укотовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПередержке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мертв</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПеремещениеЖивотного/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ответственный = Пользователи.АвторизованныйПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура КошкаПриИзменении(Элемент)
	
	КошкуМожноПеремещать = КошкуМожноПеремещать(Объект.Кошка);
	Если НЕ КошкуМожноПеремещать Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция КошкуМожноПеремещать(Кошка)

	КошкуМожноПеремещать = Истина;
	
	ТекущиеСтатусМестоСодержания = ТекущиеСтатусМестоСодержания(Кошка);
	
	Если ТекущиеСтатусМестоСодержания.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыПребыванияЖивотных.Укотовлен") Тогда
		ТекстОшибки = СтрШаблон("Подопечный %1 укотовлен(а)! Перемещение невозможно!", Кошка);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КошкуМожноПеремещать = Ложь;
	ИначеЕсли ТекущиеСтатусМестоСодержания.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыПребыванияЖивотных.Мертв") Тогда
		ТекстОшибки = СтрШаблон("Подопечный %1 мертв(а)! Перемещение невозможно!", Кошка);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КошкуМожноПеремещать = Ложь;
	КонецЕсли;
	
	Если НЕ ТекущиеСтатусМестоСодержания.МестоСодержания = Неопределено Тогда
	// TODO: Убрать заполнение отсюда!
		Объект.КомнатаДо = ТекущиеСтатусМестоСодержания.МестоСодержания;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось определить текущее место содержания кошки!");
		КошкуМожноПеремещать = Ложь;
	КонецЕсли;
	
	Возврат КошкуМожноПеремещать;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекущиеСтатусМестоСодержания(Кошка)
	
	ТекущиеСтатусМестоСодержания = Новый Структура("Статус,МестоСодержания");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.МестоСодержания КАК МестоСодержания,
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыМестаСодержанияЖивотных.СрезПоследних(&ДатаПеремещения, Кошка = &Кошка) КАК СтатусыМестаСодержанияЖивотныхСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаПеремещения", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Кошка", Кошка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекущиеСтатусМестоСодержания.Статус           = Выборка.Статус;
		ТекущиеСтатусМестоСодержания.МестоСодержания  = Выборка.МестоСодержания;
	КонецЕсли;
	
	Возврат ТекущиеСтатусМестоСодержания;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ КошкуМожноПеремещать(Объект.Кошка) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Объект.КомнатаПосле = Объект.КомнатаДо Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Комната до и после перемещения совпадает!");
		Отказ = Истина;
	КонецЕсли;
	
	НазначениеКомнатыПосле = НазначениеКомнаты(Объект.КомнатаПосле);
	Если Объект.КомнатаДо = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.Комнаты.Приемная") 
		И НЕ НазначениеКомнатыПосле = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.НазначенияКомнат.Карантин") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("После Приемной обязательно перемещение в Карантин на 21 день!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&наСервереБезКонтекста
Функция НазначениеКомнаты(Комната)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Комнаты.Назначение КАК Назначение
		|ИЗ
		|	Справочник.Комнаты КАК Комнаты
		|ГДЕ
		|	Комнаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Комната);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		НазначениеКомнаты = Выборка.Назначение;
	КонецЕсли;
	
	Возврат НазначениеКомнаты;

КонецФункции
